SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_dma.h
/***********************************************************************************************************************
    @file     reg_dma.h
    @author   VV TEAM
    @brief    This flie contains all the DMA's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_DMA_H
#define __REG_DMA_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief DMA Base Address Definition
  */
#define  DMA1_BASE                                 0x40020000                                       /*!<Base Address: 0x40020000*/
#define  DMA1_Channel1_BASE                        (DMA1_BASE    + 0x0008U)                         /*!<Base Address: (DMA1_BASE    + 0x0008U)*/
#define  DMA1_Channel2_BASE                        (DMA1_BASE    + 0x001CU)                         /*!<Base Address: (DMA1_BASE    + 0x001CU)*/
#define  DMA1_Channel3_BASE                        (DMA1_BASE    + 0x0030U)                         /*!<Base Address: (DMA1_BASE    + 0x0030U)*/
#define  DMA1_Channel4_BASE                        (DMA1_BASE    + 0x0044U)                         /*!<Base Address: (DMA1_BASE    + 0x0044U)*/
#define  DMA1_Channel5_BASE                        (DMA1_BASE    + 0x0058U)                         /*!<Base Address: (DMA1_BASE    + 0x0058U)*/
#define  DMA1_Channel6_BASE                        (DMA1_BASE    + 0x006CU)                         /*!<Base Address: (DMA1_BASE    + 0x006CU)*/
#define  DMA1_Channel7_BASE                        (DMA1_BASE    + 0x0080U)                         /*!<Base Address: (DMA1_BASE    + 0x0080U)*/
#define  DMA1_Channel8_BASE                        (DMA1_BASE    + 0x0094U)                         /*!<Base Address: (DMA1_BASE    + 0x0094U)*/
#define  DMA2_BASE                                 0x40020400                                       /*!<Base Address: 0x40020400*/
#define  DMA2_Channel1_BASE                        (DMA2_BASE    + 0x0008U)                         /*!<Base Address: (DMA2_BASE    + 0x0008U)*/
#define  DMA2_Channel2_BASE                        (DMA2_BASE    + 0x001CU)                         /*!<Base Address: (DMA2_BASE    + 0x001CU)*/
#define  DMA2_Channel3_BASE                        (DMA2_BASE    + 0x0030U)                         /*!<Base Address: (DMA2_BASE    + 0x0030U)*/
#define  DMA2_Channel4_BASE                        (DMA2_BASE    + 0x0044U)                         /*!<Base Address: (DMA2_BASE    + 0x0044U)*/
#define  DMA2_Channel5_BASE                        (DMA2_BASE    + 0x0058U)                         /*!<Base Address: (DMA2_BASE    + 0x0058U)*/
#define  DMA2_Channel6_BASE                        (DMA2_BASE    + 0x006CU)                         /*!<Base Address: (DMA2_BASE    + 0x006CU)*/
#define  DMA2_Channel7_BASE                        (DMA2_BASE    + 0x0080U)                         /*!<Base Address: (DMA2_BASE    + 0x0080U)*/
#define  DMA2_Channel8_BASE                        (DMA2_BASE    + 0x0094U)                         /*!<Base Address: (DMA2_BASE    + 0x0094U)*/

/**
  * @brief DMA Register Structure Definition
  */
typedef struct
{
    __IO uint32_t ISR;                            /*!<DMA DMA interrupt status register              offset: 0x00       */
    __IO uint32_t IFCR;                           /*!<DMA DMA interrupt flag clear register          offset: 0x04       */
} DMA_TypeDef;

/**
  * @brief DMA_Channel Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CCR;                            /*!<DMA DMA channel x configuration register       offset: 0x00       */
    __IO uint32_t CNDTR;                          /*!<DMA DMA channel x number of data register      offset: 0x04       */
    __IO uint32_t CPAR;                           /*!<DMA DMA channel x peripheral address register  offset: 0x08       */
    __IO uint32_t CMAR;                           /*!<DMA DMA channel x memory address register      offset: 0x0C       */
} DMA_Channel_TypeDef;

/**
  * @brief DMA type pointer Definition
  */
#define DMA1                                      ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1                             ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2                             ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3                             ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4                             ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5                             ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define DMA1_Channel6                             ((DMA_Channel_TypeDef *)DMA1_Channel6_BASE)
#define DMA1_Channel7                             ((DMA_Channel_TypeDef *)DMA1_Channel7_BASE)
#define DMA1_Channel8                             ((DMA_Channel_TypeDef *)DMA1_Channel8_BASE)
#define DMA2                                      ((DMA_TypeDef *)DMA2_BASE)
#define DMA2_Channel1                             ((DMA_Channel_TypeDef *)DMA2_Channel1_BASE)
#define DMA2_Channel2                             ((DMA_Channel_TypeDef *)DMA2_Channel2_BASE)
#define DMA2_Channel3                             ((DMA_Channel_TypeDef *)DMA2_Channel3_BASE)
#define DMA2_Channel4                             ((DMA_Channel_TypeDef *)DMA2_Channel4_BASE)
#define DMA2_Channel5                             ((DMA_Channel_TypeDef *)DMA2_Channel5_BASE)
#define DMA2_Channel6                             ((DMA_Channel_TypeDef *)DMA2_Channel6_BASE)
#define DMA2_Channel7                             ((DMA_Channel_TypeDef *)DMA2_Channel7_BASE)
#define DMA2_Channel8                             ((DMA_Channel_TypeDef *)DMA2_Channel8_BASE)

/**
  * @brief DMA_ISR Register Bit Definition
  */
#define  DMA_ISR_GIF1_Pos                         (0)
#define  DMA_ISR_GIF1_Msk                         (0x1U << DMA_ISR_GIF1_Pos)                        /*!<Channel 1 global interrupt flag*/
#define  DMA_ISR_GIF1                             DMA_ISR_GIF1_Msk
#define  DMA_ISR_TCIF1_Pos                        (1)
#define  DMA_ISR_TCIF1_Msk                        (0x1U << DMA_ISR_TCIF1_Pos)                       /*!<Channel 1 transfer complete flag*/
#define  DMA_ISR_TCIF1                            DMA_ISR_TCIF1_Msk
#define  DMA_ISR_HTIF1_Pos                        (2)
#define  DMA_ISR_HTIF1_Msk                        (0x1U << DMA_ISR_HTIF1_Pos)                       /*!<Channel 1 half transfer flag*/
#define  DMA_ISR_HTIF1                            DMA_ISR_HTIF1_Msk
#define  DMA_ISR_TEIF1_Pos                        (3)
#define  DMA_ISR_TEIF1_Msk                        (0x1U << DMA_ISR_TEIF1_Pos)                       /*!<Channel 1 transfer error flag*/
#define  DMA_ISR_TEIF1                            DMA_ISR_TEIF1_Msk
#define  DMA_ISR_GIF2_Pos                         (4)
#define  DMA_ISR_GIF2_Msk                         (0x1U << DMA_ISR_GIF2_Pos)                        /*!<Channel 2 global interrupt flag*/
#define  DMA_ISR_GIF2                             DMA_ISR_GIF2_Msk
#define  DMA_ISR_TCIF2_Pos                        (5)
#define  DMA_ISR_TCIF2_Msk                        (0x1U << DMA_ISR_TCIF2_Pos)                       /*!<Channel 2 transfer complete flag*/
#define  DMA_ISR_TCIF2                            DMA_ISR_TCIF2_Msk
#define  DMA_ISR_HTIF2_Pos                        (6)
#define  DMA_ISR_HTIF2_Msk                        (0x1U << DMA_ISR_HTIF2_Pos)                       /*!<Channel 2 half transfer flag*/
#define  DMA_ISR_HTIF2                            DMA_ISR_HTIF2_Msk
#define  DMA_ISR_TEIF2_Pos                        (7)
#define  DMA_ISR_TEIF2_Msk                        (0x1U << DMA_ISR_TEIF2_Pos)                       /*!<Channel 2 transfer error flag*/
#define  DMA_ISR_TEIF2                            DMA_ISR_TEIF2_Msk
#define  DMA_ISR_GIF3_Pos                         (8)
#define  DMA_ISR_GIF3_Msk                         (0x1U << DMA_ISR_GIF3_Pos)                        /*!<Channel 3 global interrupt flag*/
#define  DMA_ISR_GIF3                             DMA_ISR_GIF3_Msk
#define  DMA_ISR_TCIF3_Pos                        (9)
#define  DMA_ISR_TCIF3_Msk                        (0x1U << DMA_ISR_TCIF3_Pos)                       /*!<Channel 3 transfer complete flag*/
#define  DMA_ISR_TCIF3                            DMA_ISR_TCIF3_Msk
#define  DMA_ISR_HTIF3_Pos                        (10)
#define  DMA_ISR_HTIF3_Msk                        (0x1U << DMA_ISR_HTIF3_Pos)                       /*!<Channel 3 half transfer flag*/
#define  DMA_ISR_HTIF3                            DMA_ISR_HTIF3_Msk
#define  DMA_ISR_TEIF3_Pos                        (11)
#define  DMA_ISR_TEIF3_Msk                        (0x1U << DMA_ISR_TEIF3_Pos)                       /*!<Channel 3 transfer error flag*/
#define  DMA_ISR_TEIF3                            DMA_ISR_TEIF3_Msk
#define  DMA_ISR_GIF4_Pos                         (12)
#define  DMA_ISR_GIF4_Msk                         (0x1U << DMA_ISR_GIF4_Pos)                        /*!<Channel 4 global interrupt flag*/
#define  DMA_ISR_GIF4                             DMA_ISR_GIF4_Msk
#define  DMA_ISR_TCIF4_Pos                        (13)
#define  DMA_ISR_TCIF4_Msk                        (0x1U << DMA_ISR_TCIF4_Pos)                       /*!<Channel 4 transfer complete flag*/
#define  DMA_ISR_TCIF4                            DMA_ISR_TCIF4_Msk
#define  DMA_ISR_HTIF4_Pos                        (14)
#define  DMA_ISR_HTIF4_Msk                        (0x1U << DMA_ISR_HTIF4_Pos)                       /*!<Channel 4 half transfer flag*/
#define  DMA_ISR_HTIF4                            DMA_ISR_HTIF4_Msk
#define  DMA_ISR_TEIF4_Pos                        (15)
#define  DMA_ISR_TEIF4_Msk                        (0x1U << DMA_ISR_TEIF4_Pos)                       /*!<Channel 4 transfer error flag*/
#define  DMA_ISR_TEIF4                            DMA_ISR_TEIF4_Msk
#define  DMA_ISR_GIF5_Pos                         (16)
#define  DMA_ISR_GIF5_Msk                         (0x1U << DMA_ISR_GIF5_Pos)                        /*!<Channel 5 global interrupt flag*/
#define  DMA_ISR_GIF5                             DMA_ISR_GIF5_Msk
#define  DMA_ISR_TCIF5_Pos                        (17)
#define  DMA_ISR_TCIF5_Msk                        (0x1U << DMA_ISR_TCIF5_Pos)                       /*!<Channel 5 transfer complete flag*/
#define  DMA_ISR_TCIF5                            DMA_ISR_TCIF5_Msk
#define  DMA_ISR_HTIF5_Pos                        (18)
#define  DMA_ISR_HTIF5_Msk                        (0x1U << DMA_ISR_HTIF5_Pos)                       /*!<Channel 5 half transfer flag*/
#define  DMA_ISR_HTIF5                            DMA_ISR_HTIF5_Msk
#define  DMA_ISR_TEIF5_Pos                        (19)
#define  DMA_ISR_TEIF5_Msk                        (0x1U << DMA_ISR_TEIF5_Pos)                       /*!<Channel 5 transfer error flag*/
#define  DMA_ISR_TEIF5                            DMA_ISR_TEIF5_Msk
#define  DMA_ISR_GIF6_Pos                         (20)
#define  DMA_ISR_GIF6_Msk                         (0x1U << DMA_ISR_GIF6_Pos)                        /*!<Channel 6 global interrupt flag*/
#define  DMA_ISR_GIF6                             DMA_ISR_GIF6_Msk
#define  DMA_ISR_TCIF6_Pos                        (21)
#define  DMA_ISR_TCIF6_Msk                        (0x1U << DMA_ISR_TCIF6_Pos)                       /*!<Channel 6 transfer complete flag*/
#define  DMA_ISR_TCIF6                            DMA_ISR_TCIF6_Msk
#define  DMA_ISR_HTIF6_Pos                        (22)
#define  DMA_ISR_HTIF6_Msk                        (0x1U << DMA_ISR_HTIF6_Pos)                       /*!<Channel 6 half transfer flag*/
#define  DMA_ISR_HTIF6                            DMA_ISR_HTIF6_Msk
#define  DMA_ISR_TEIF6_Pos                        (23)
#define  DMA_ISR_TEIF6_Msk                        (0x1U << DMA_ISR_TEIF6_Pos)                       /*!<Channel 6 transfer error flag*/
#define  DMA_ISR_TEIF6                            DMA_ISR_TEIF6_Msk
#define  DMA_ISR_GIF7_Pos                         (24)
#define  DMA_ISR_GIF7_Msk                         (0x1U << DMA_ISR_GIF7_Pos)                        /*!<Channel 7 global interrupt flag*/
#define  DMA_ISR_GIF7                             DMA_ISR_GIF7_Msk
#define  DMA_ISR_TCIF7_Pos                        (25)
#define  DMA_ISR_TCIF7_Msk                        (0x1U << DMA_ISR_TCIF7_Pos)                       /*!<Channel 7 transfer complete flag*/
#define  DMA_ISR_TCIF7                            DMA_ISR_TCIF7_Msk
#define  DMA_ISR_HTIF7_Pos                        (26)
#define  DMA_ISR_HTIF7_Msk                        (0x1U << DMA_ISR_HTIF7_Pos)                       /*!<Channel 7 half transfer flag*/
#define  DMA_ISR_HTIF7                            DMA_ISR_HTIF7_Msk
#define  DMA_ISR_TEIF7_Pos                        (27)
#define  DMA_ISR_TEIF7_Msk                        (0x1U << DMA_ISR_TEIF7_Pos)                       /*!<Channel 7 transfer error flag*/
#define  DMA_ISR_TEIF7                            DMA_ISR_TEIF7_Msk
#define  DMA_ISR_GIF8_Pos                         (28)
#define  DMA_ISR_GIF8_Msk                         (0x1U << DMA_ISR_GIF8_Pos)                        /*!<Channel 8 global interrupt flag*/
#define  DMA_ISR_GIF8                             DMA_ISR_GIF8_Msk
#define  DMA_ISR_TCIF8_Pos                        (29)
#define  DMA_ISR_TCIF8_Msk                        (0x1U << DMA_ISR_TCIF8_Pos)                       /*!<Channel 8 transfer complete flag*/
#define  DMA_ISR_TCIF8                            DMA_ISR_TCIF8_Msk
#define  DMA_ISR_HTIF8_Pos                        (30)
#define  DMA_ISR_HTIF8_Msk                        (0x1U << DMA_ISR_HTIF8_Pos)                       /*!<Channel 8 half transfer flag*/
#define  DMA_ISR_HTIF8                            DMA_ISR_HTIF8_Msk
#define  DMA_ISR_TEIF8_Pos                        (31)
#define  DMA_ISR_TEIF8_Msk                        (0x1U << DMA_ISR_TEIF8_Pos)                       /*!<Channel 8 transfer error flag*/
#define  DMA_ISR_TEIF8                            DMA_ISR_TEIF8_Msk

